package com.ruoyi.components.utils;

import java.util.HashMap;
import java.util.Map;

/**
 * @author HBF
 * @date 2022-10-25 14:19
 * @description: 用来存放爬取全国公共资源交易平台（广西壮族自治区）使用到的静态常量
 */
public class GxggzyBidConstant {

    // 工程建设
    public static final Map<String, String> ENGINEERING_CONSTRUCTION = new HashMap<String, String>() {{
        // 工程建设/房屋市政/招标公告001001001001
        // 工程建设/水利工程/招标公告001001002001
        // 工程建设/交通工程/招标公告001001003001
        // 工程建设/铁路工程/招标公告001001004001
        // 工程建设/其他工程/招标公告001001005001
        put("001001001001", "工程建设/房屋市政/招标公告");
        put("001001002001", "工程建设/水利工程/招标公告");
        put("001001003001", "工程建设/交通工程/招标公告");
        put("001001004001", "工程建设/铁路工程/招标公告");
        put("001001005001", "工程建设/其他工程/招标公告");
        // 工程建设/房屋市政/中标结果公告001001001005
        // 工程建设/水利工程/中标结果公告001001002005
        // 工程建设/交通工程/中标结果公告001001003005
        // 工程建设/铁路工程/中标结果公告001001004005
        // 工程建设/其他工程/中标结果公告001001005005
        put("001001001005", "工程建设/房屋市政/中标结果公告");
        put("001001002005", "工程建设/水利工程/中标结果公告");
        put("001001003005", "工程建设/交通工程/中标结果公告");
        put("001001004005", "工程建设/铁路工程/中标结果公告");
        put("001001005005", "工程建设/其他工程/中标结果公告");
    }};

    // 政府采购
    public static final Map<String, String> GOVERNMENT_PROCUREMENT = new HashMap<String, String>() {{
        // 政府采购/公开招标/采购公告001002005002
        // 政府采购/公开招标/中标结果001002005004
        // 政府采购/竞争性谈判/采购公告001002007001
        // 政府采购/竞争性谈判/中标结果001002007003
        // 政府采购/竞争性磋商/采购公告001002008001
        // 政府采购/竞争性磋商/中标结果001002008003
        // 政府采购/询价/采购公告001002009001
        // 政府采购/询价/中标结果001002009003
        // 政府采购/单一来源/采购公告001002010001
        // 政府采购/单一来源/中标结果001002010003
        put("001002005002", "政府采购/公开招标/采购公告");
        put("001002007001", "政府采购/竞争性谈判/采购公告");
        put("001002008001", "政府采购/竞争性磋商/采购公告");
        put("001002009001", "政府采购/询价/采购公告");
        put("001002010001", "政府采购/单一来源/采购公告");
        put("001002005004", "政府采购/公开招标/中标结果");
        put("001002007003", "政府采购/竞争性谈判/中标结果");
        put("001002008003", "政府采购/竞争性磋商/中标结果");
        put("001002009003", "政府采购/询价/中标结果");
        put("001002010003", "政府采购/单一来源/中标结果");
    }};

    // 其他交易
    public static final Map<String, String> OTHER_TRANSACTIONS = new HashMap<String, String>() {{
        // 其他交易/交易公告001006001
        // 其他交易/交易结果001006002
        put("001006001", "其他交易/交易公告");
        put("001006002", "其他交易/交易结果");
    }};
}
